Repository: motis-project/ridesharing-flutter
Catalog: lib/l10n/app_*.arb
Languages: de

source: Cancel
de: Abbrechen

source: More
de: Mehr

source: Yes
de: Ja

source: No
de: Nein

source: Approve
de: Annehmen

source: Reject
de: Ablehnen

source: Expand
de: Erweitern

source: Retract
de: Einklappen

source: Edit
de: Bearbeiten

source: Save
de: Speichern

# failureSnackBar
source: Something went wrong.
de: Es ist ein Fehler aufgetreten.

source: Riders
de: Mitfahrer*innen

source: Seats
de: Plätze

# seatsCount
source: {count, plural, =1{{count} seat}, other{{count} seats}}
de: {count, plural, one{1 Platz} other{{count} Plätze}}

# labelXOfYseats
source: {seats} of {maxSeats} seats
de: {seats} von {maxSeats} Plätzen

# labelUnknownSeats
source: unknown number of {maxSeats} seats
de: Unbekannte Anzahl von {maxSeats} Plätzen

source: Open Chat
de: Chat öffnen

source: Open Details
de: Details öffnen

source: See profile
de: Profil ansehen

# ratingBarSemantics
source: {rating} stars
de: {rating} Sterne

# authEmailLinkInvalid
source: Email link is invalid or has expired.
de: Email-Link ist ungültig oder abgelaufen.

# formEmailHint
source: Enter your email address
de: Gib deine E-Mail-Adresse ein

# formEmailValidateEmpty
source: Please enter your email address
de: Bitte gib deine E-Mail-Adresse ein

# formEmailValidateInvalid
source: Please enter a valid email address
de: Bitte gib eine gültige E-Mail-Adresse ein

# formPassword
source: Password
de: Passwort

# formPasswordHint
source: Enter your password
de: Gib dein Passwort ein

# formPasswordValidateEmpty
source: Please enter your password
de: Bitte gib dein Passwort ein

# formPasswordValidateMinLength
source: Password must be at least 8 characters
de: Passwort muss mindestens 8 Zeichen lang sein

# formPasswordValidateNumber
source: Password must contain at least one number
de: Passwort muss mindestens eine Zahl enthalten

# formPasswordValidateUppercase
source: Password must contain at least one uppercase letter
de: Passwort muss mindestens einen Großbuchstaben enthalten

# formPasswordValidateLowercase
source: Password must contain at least one lowercase letter
de: Passwort muss mindestens einen Kleinbuchstaben enthalten

# formPasswordValidateSpecial
source: Password must contain at least one special character
de: Passwort muss mindestens ein Sonderzeichen enthalten

# formPasswordConfirm
source: Confirm Password
de: Passwort bestätigen

# formPasswordConfirmHint
source: Re-enter your password
de: Gib dein Passwort erneut ein

# formPasswordConfirmValidateEmpty
source: Please confirm your password
de: Bitte gib dein Passwort erneut ein

# formPasswordConfirmValidateMatch
source: Passwords do not match
de: Passwörter stimmen nicht überein

# formDate
source: Date
de: Datum

# formTime
source: Time
de: Zeit

# formTimeValidateEmpty
source: Please choose a time
de: Bitte wähle eine Zeit

# formTimeValidateFuture
source: Please choose a time in the future
de: Bitte wähle eine Zeit in der Zukunft

# formAddressStartHint
source: Enter your starting location
de: Gib deinen Startort ein

# formAddressStartValidateEmpty
source: Please enter your starting location
de: Bitte gib deinen Startort ein

# formAddressDestination
source: Destination
de: Ziel

# formAddressDestinationHint
source: Enter your destination
de: Gib dein Ziel ein

# formAddressDestinationValidateEmpty
source: Please enter your destination
de: Bitte gib dein Ziel ein

# formClearInput
source: Clear input
de: Eingabe entfernen

# formSubmit
source: Submit
de: Absenden

# formSubmitFail
source: Failed
de: Fehler

# formSubmitSuccess
source: Success
de: Erfolg

# searchAddressEnterMoreCharacters
source: Please enter more information to get results
de: Bitte gib mehr Zeichen ein, um eine Adresse zu finden.

# pageWelcomeAnonymousSearch
source: Anonymous Search
de: Anonym suchen

# pageWelcomeRegister
source: Register
de: Registrieren

# pageRegisterTitle
source: Register
de: Registrieren

# pageRegisterUsername
source: Username
de: Nutzername

# pageRegisterUsernameHint
source: We recommend you choose your real name
de: Gib deinen Nutzernamen ein

# pageRegisterUsernameValidateEmpty
source: Please enter your username
de: Bitte gib deinen Nutzernamen ein

# pageRegisterButtonCreate
source: Create Account
de: Account erstellen

# pageRegisterButtonCreated
source: Account created
de: Account erstellt

# pageLoginFailureCredentials
source: Invalid username or password
de: Falsche E-Mail-Adresse oder Passwort

# pageLoginFailureEmailNotConfirmed
source: Please confirm your email address
de: Bitte bestätige deine E-Mail-Adresse

# pageLoginButtonForgotPassword
source: Forgot password?
de: Passwort vergessen?

# pageLoginNoAccount
source: No account yet? Register here.
de: Noch keinen Account? Hier registrieren

# pageForgotPasswordTitle
source: Reset Password
de: Passwort vergessen

# pageForgotPasswordButtonSend
source: Send recovery
de: Senden

# pageForgotPasswordButtonSent
source: Sent
de: Gesendet

# pageResetPasswordTitle
source: Reset Password
de: Passwort zurücksetzen

# pageResetPasswordButtonReset
source: Reset password
de: Passwort setzen

# pageResetPasswordHint
source: Enter your new password
de: Gib dein neues Passwort ein

# pageResetPasswordValidateEmpty
source: Please enter your new password
de: Bitte gib dein neues Passwort ein

# pageResetPasswordConfirmHint
source: Re-enter your new password
de: Bitte gib dein neues Passwort erneut ein

# pageResetPasswordConfirmValidateEmpty
source: Please confirm your new password
de: Bitte gib dein neues Passwort erneut ein

# pageAboutTitle
source: About
de: Über uns

# pageAboutBuildNumber
source: Build number: {number}
de: Build-Nummer: {number}

# pageAboutBuildSignature
source: Build signature: {signature}
de: Build-Signatur: {signature}

# pageAboutText
source: This app was coded by a group of students at TU Darmstadt. Licensed under the MIT License.
de: Diese App wurde von einer Gruppe Studierender an der TU Darmstadt programmiert. Lizensiert unter der MIT-Lizenz

# pageAboutTermsOfService
source: Terms of service
de: Nutzungsbedingungen

# pageAccountSignOut
source: Sign Out
de: Ausloggen

# pageAccountLanguage
source: Language
de: Sprache

# pageAccountHelp
source: Help
de: Hilfe

# pageAccountAbout
source: About
de: Über uns

# pageAccountThemesLight
source: Light
de: Hell

# pageAccountThemesDark
source: Dark
de: Dunkel

# pageProfileUpdateProfilePictureTitle
source: Update profile picture
de: Profilbild aktualisieren

# pageProfileUpdateProfilePictureFromGallery
source: From Gallery
de: Bild auswählen

# pageProfileUpdateProfilePictureDelete
source: Delete
de: Löschen

# pageProfileDescriptionTitle
source: Description
de: Beschreibung

# pageProfileDescriptionEmpty
source: No description
de: Keine Beschreibung

# pageProfileFullNameTitle
source: Full Name
de: Name

# pageProfileFullNameEmpty
source: No full name
de: Kein Name

# pageProfileGenderTitle
source: Gender
de: Geschlecht

# pageProfileGenderEmpty
source: No gender
de: Kein Geschlecht

# pageProfileFeaturesTitle
source: Features
de: Eigenschaften

# pageProfileFeaturesEmpty
source: No features
de: Keine Eigenschaften

# pageProfileReviewsTitle
source: Reviews
de: Bewertungen

# pageProfileButtonReport
source: Report User
de: Nutzer melden

# pageProfileButtonReported
source: User reported
de: Nutzer gemeldet

# pageProfileButtonMessage
source: Your report has been sent. We will review it as soon as possible.
de: Deine Meldung wurde an uns gesendet. Wir werden uns so schnell wie möglich darum kümmern.

# pageProfileEditBirthDateTitle
source: Edit Birth Date
de: Geburtsdatum bearbeiten

# pageProfileEditBirthDateHint
source: Enter your birth date
de: Gib dein Geburtsdatum ein

# pageProfileEditDescriptionTitle
source: Edit Description
de: Beschreibung bearbeiten

# pageProfileEditDescriptionHint
source: Enter a description
de: Gib eine Beschreibung ein

# pageProfileEditFullNameTitle
source: Edit Full Name
de: Namen bearbeiten

# pageProfileEditSurnameHint
source: Enter your first name
de: Gib deinen Vornamen ein

# pageProfileEditNameHint
source: Enter your last name
de: Gib deinen Nachnamen ein

# pageProfileEditGenderTitle
source: Choose Gender
de: Geschlecht wählen

# pageProfileEditGenderPreferNotToSay
source: Prefer not to say
de: Keine Angabe

# pageProfileEditProfileFeaturesTitle
source: Order your profile features
de: Ordne deine Profileigenschaften

# pageProfileEditProfileFeaturesHint
source: Drag your profile features here
de: Ziehe Eigenschaften hierher, um sie hinzuzufügen

# pageProfileEditProfileFeaturesSelected
source: Selected
de: Ausgewählt

# pageProfileEditProfileFeaturesNotSelected
source: Not selected
de: Nicht ausgewählt

# pageProfileEditProfileFeaturesMutuallyExclusive
source: Mutually exclusive feature already selected: {feature}
de: Ausschließende Eigenschaft bereits gewählt: {feature}

# pageProfileEditUsernameTitle
source: Edit Username
de: Nutzernamen bearbeiten

# pageProfileEditUsernameHint
source: Enter your username
de: Gib deinen Nutzernamen ein

# pageProfileEditUsernameValidateEmpty
source: Username cannot be empty
de: Nutzername darf nicht leer sein

# widgetAvatarDetailsLabel
source: Profile picture
de: Profilbild

# widgetAvatarDetailsTooltip
source: See details
de: Details anzeigen

# widgetAvatarUploadTooltip
source: Upload new picture
de: Profilbild hochladen

# widgetAvatarImageCouldNotBeStored
source: Image could not be stored.
de: Bild konnte nicht gespeichert werden.

# pageHelpTitle
source: Help
de: Hilfe

# pageHelpContactUs
source: Contact Us
de: Kontaktiere uns

# pageHelpEmailSubject
source: Inquiry by User-ID [{id}]
de: Anfrage von User-ID [{id}]

# pageHelpQuestion1
source: What is MOTIS?
de: Was ist MOTIS?

# pageHelpAnswer1
source: MOTIS encompasses many tools to support intermodal routing. Its goal is to help plan journeys that include public transport, bike sharing, ride sharing and more modes of transportation.
de: MOTIS umfasst viele Tools zur Unterstützung des intermodalen Routings. Das Ziel ist es, bei der Planung von Reisen zu helfen, die öffentliche Verkehrsmittel, Bike-Sharing, Ride-Sharing und weitere Transportmittel umfassen.

# pageHelpQuestion2
source: How much do rides cost? How can I pay?
de: Wie viel kosten Fahrten? Wie kann ich bezahlen?

# pageHelpAnswer2
source: We designed the payment process to fully rely on user agreements. Both the cost and payment method of a ride can be negotiated in person or in our in-app chat. You will see a price suggestion for most rides as a starting point.
de: Wir haben den Zahlungsprozess so konzipiert, dass er sich vollständig auf Benutzer*innenvereinbarungen stützt. Sowohl die Kosten als auch die Zahlungsmethode einer Fahrt können persönlich oder in unserem In-App-Chat ausgehandelt werden. Als Ausgangspunkt siehst du für die meisten Fahrten einen Preisvorschlag.

# pageHelpQuestion3
source: We agreed on a price, but now my rider isn't paying it. What can I do?
de: Wir haben uns auf einen Preis geeinigt, aber jetzt zahlt mein*e Fahrer*in ihn nicht. Was kann ich machen?

# pageHelpAnswer3
source: We're sorry for the inconvenience. Unfortunately, the only thing we can offer you is the ability to report users in that case. Tap the "{reportButtonText}" button on their profile and make sure to select the reason "{didNotPayReasonText}".
de: Wir entschuldigen uns für die Unannehmlichkeiten. Leider können wir dir in diesem Fall nur die Möglichkeit bieten, Benutzer*innen zu melden. Tippe in seinem*ihrem Profil auf die Schaltfläche "{reportButtonText}" und stelle sicher, dass du den Grund "{didNotPayReasonText}" auswählst.

# pageHelpQuestion4
source: A driver/rider didn't show up. What can I do?
de: Ein*e Fahrer*in/Mitfahrer*in ist nicht aufgetaucht. Was kann ich machen?

# pageHelpAnswer4
source: We're sorry for the inconvenience. Unfortunately, the only thing we can offer you is the ability to report users in that case. Tap the "{reportButtonText}" button on their profile and make sure to select the reason "{didNotShowUpReasonText}".
de: Wir entschuldigen uns für die Unannehmlichkeiten. Leider können wir dir in diesem Fall nur die Möglichkeit bieten, Benutzer*innen zu melden. Tippe in seinem*ihrem Profil auf die Schaltfläche "{reportButtonText}" und achte darauf, den Grund "{didNotShowUpReasonText}" auszuwählen.

# pageHelpQuestion5
source: My ride got cancelled. What can I do?
de: Meine Mitfahrt wurde abgesagt. Was kann ich machen?

# pageHelpAnswer5
source: We're sorry for the inconvenience. Unfortunately, you will have to look for another ride. If the driver cancelled the drive just before the trip, you can report them using the "{reportButtonText}" button on their profile. Make sure to select the reason "{otherReasonText}" and explain the situation.
de: Wir entschuldigen uns für die Unannehmlichkeiten. Leider musst du dich nach einer anderen Fahrt umsehen. Wenn die*der Fahrer*in die Fahrt kurz vor der Fahrt abgesagt hat, kannst du sie*ihn über die Schaltfläche "{reportButtonText}" in ihrem*seinem Profil melden. Stelle sicher, dass du den Grund "{differentReasonText}" auswählst und die Situation erklärst.

# pageHelpQuestion6
source: My ride was rejected. What can I do?
de: Meine Mitfahrt wurde abgelehnt. Was kann ich machen?

# pageHelpAnswer6
source: We're sorry for the inconvenience. Unfortunately, you will have to look for another ride.
de: Wir entschuldigen uns für die Unannehmlichkeiten. Leider musst du dich nach einer anderen Fahrt umsehen.

# pageHelpQuestion7
source: The driver isn't reacting to my request. What can I do?
de: Die*Der Fahrer*in reagiert nicht auf meine Anfrage. Was kann ich machen?

# pageHelpAnswer7
source: We're sorry for the inconvenience. Please tap on the ride and withdraw your request using the "{withdrawButtonText}" button at the bottom. You can look for a new ride using the ride search.
de: Wir entschuldigen uns für die Unannehmlichkeiten. Bitte tippe auf die Mitfahrt und nimm deine Anfrage über die "{withdrawButtonText}"-Schaltfläche unten zurück. Du kannst über unsere Mitfahrtsuche nach einer neuen Mitfahrgelegenheit suchen.

# pageHelpQuestion8
source: My driver/riders are misbehaving. What can I do?
de: Mein*e Fahrer*in/meine Mitfahrer*innen benehmen sich schlecht. Was kann ich machen?

# pageHelpAnswer8
source: We're sorry for the inconvenience. We are not responsible for the actions of our users. If other users are using bad language or behaving aggressively, offensively or otherwise inappropriately, please report them using the "{reportButtonText}" button on their profile. Make sure to select the appropriate reason.
de: Wir entschuldigen uns für die Unannehmlichkeiten. Wir sind nicht verantwortlich für die Handlungen unserer Benutzer*innen. Wenn andere Benutzer*innen Schimpfworte verwenden oder sich aggressiv, beleidigend oder anderweitig unangemessen verhalten, melde sie bitte über die Schaltfläche "{reportButtonText}" in ihrem Profil. Stelle sicher, dass du den richtigen Grund auswählst.

# pageHelpQuestion9
source: Where can I edit my profile?
de: Wo kann ich mein Profil bearbeiten?

# pageHelpAnswer9
source: You can tap on your user name at the top of the "{accountTabText}" tab.
de: Du kannst oben unter dem Tab "{accountTabText}" auf deinen Benutzernamen tippen.

# pageHelpQuestion10
source: Where can I offer drives?
de: Wo kann ich Fahrten anbieten?

# pageHelpAnswer10
source: You can tap on the "+" icon at the bottom right of the "{drivesTabText}" tab.
de: Du kannst auf das "+"-Symbol unten rechts unter dem Tab "{drivesTabText}" tippen.

# pageHelpQuestion11
source: Where can I book rides?
de: Wo kann ich Mitfahrten buchen?

# pageHelpAnswer11
source: You can tap on the "magnifying glass" icon at the bottom right of the "{ridesTabText}" tab.
de: Du kannst auf das "Lupe"-Symbol unten rechts unter dem Tab "{ridesTabText}" tippen.

# pageHelpQuestion12
source: Where can I rate my driver?
de: Wo kann ich meine*n Fahrer*in bewerten?

# pageHelpAnswer12
source: You are eligible to rate your driver if you drove with him in the past. To do this, click on that ride and you should see a "{rateButtonText}" button above the reviews.
de: Du bist berechtigt, deine*n Fahrer*in zu bewerten, wenn du in der Vergangenheit mit ihr*ihm gefahren bist. Um das zu tun, klicke auf diese Fahrt und du solltest die Schaltfläche "{rateButtonText}" über den Bewertungen sehen.

# pageHelpQuestion13
source: Where can I accept or chat with riders as a driver?
de: Wo kann ich Mitfahrer*innen als Fahrer*in akzeptieren oder mit ihnen chatten?

# pageHelpAnswer13
source: You can tap on your drive and then on the chat icon on the top right. There, you can accept or deny new requests and chat with your accepted riders.
de: Du kannst auf deine Fahrt und dann auf das Chat-Symbol oben rechts tippen. Dort kannst du neue Anfragen annehmen oder ablehnen und mit deinen akzeptierten Mitfahrer*innen chatten.

# pageHelpQuestion14
source: I have some feedback. Where can I report that?
de: Ich habe einige Rückmeldungen. Wo kann ich das melden?

# pageHelpAnswer14
source: Feedback of any kind is important to us, thank you! Please use the "{contactButtonText}" button below.
de: Feedback jeglicher Art ist uns wichtig, danke! Verwende bitte die Schaltfläche "{contactButtonText}" unten.

# pageReviewCount
source: {count, plural, =1{{count} review}, other{{count} reviews}}
de: {count, plural, one{{count} Bewertung} other{{count} Bewertungen}}

# reviewCategoryComfort
source: Comfort
de: Komfort

# reviewCategorySafety
source: Safety
de: Sicherheit

# reviewCategoryReliability
source: Reliability
de: Verlässlichkeit

# reviewCategoryHospitality
source: Hospitality
de: Gastfreundschaft

# pageReviewsTitle
source: Reviews
de: Bewertungen

# pageReviewsRate
source: Rate
de: Bewerten

# pageReviewsUpdateRating
source: Update rating
de: Bewertung aktualisieren

# reviewsPreviewReviews
source: Reviews
de: Bewertungen

# reviewsPreviewShowReviews
source: Show reviews
de: Bewertungen anzeigen

# pageWriteReviewTitle
source: Write Review
de: Bewertung schreiben

# pageWriteReviewReview
source: Review
de: Bewertung

# pageWriteReviewReviewHint
source: What did you like or dislike about the ride?
de: Was hat dir an der Fahrt gefallen? Was hat dir weniger gefallen?

# pageWriteReviewRatingRequired
source: Please rate your experience.
de: Bitte bewerte deine Erfahrung

# pageWriteReportField
source: Report
de: Meldung

# pageWriteReportFieldHint
source: Please outline the reason for the report
de: Bitte beschreibe den Grund für die Meldung

# pageWriteReportFieldValidateEmpty
source: Please enter a reason for the report
de: Bitte gib einen Grund für die Meldung ein

# modelProfileGenderMale
source: Male
de: Männlich

# modelProfileGenderFemale
source: Female
de: Weiblich

# modelProfileGenderDiverse
source: Diverse
de: Divers

# modelReportCategoryDidNotShowUp
source: Did not show up
de: Ist nicht erschienen

# modelReportCategoryDidNotPay
source: Did not pay the agreed amount
de: Hat nicht bezahlt

# modelReportCategoryDidNotFollowRules
source: Did not follow rules
de: Hat die Regeln nicht befolgt

# modelReportCategoryWasAggressive
source: Was aggressive
de: War aggressiv

# modelReportCategoryUsedBadLanguage
source: Used bad language
de: Hat Schimpfwörter verwendet

# modelReportCategoryOther
source: Other reason
de: Anderer Grund

# modelProfileFeatureNoSmoking
source: No Smoking
de: Rauchen verboten

# modelProfileFeatureSmoking
source: Smoking
de: Rauchen erlaubt

# modelProfileFeatureNoVaping
source: No Vaping
de: Vaping verboten

# modelProfileFeatureVaping
source: Vaping
de: Vaping erlaubt

# modelProfileFeatureNoPetsAllowed
source: No Pets Allowed
de: Keine Haustiere erlaubt

# modelProfileFeaturePetsAllowed
source: Pets Allowed
de: Haustiere erlaubt

# modelProfileFeatureNoChildrenAllowed
source: No Children Allowed
de: Keine Kinder erlaubt

# modelProfileFeatureChildrenAllowed
source: Children Allowed
de: Kinder erlaubt

# modelProfileFeatureTalkative
source: Talkative
de: Gesprächig

# modelProfileFeatureMusic
source: Music
de: Musik

# modelProfileFeatureQuiet
source: Quiet
de: Ruhig

# modelProfileFeatureSpeedyDrivingStyle
source: Speedy Driving Style
de: Schneller Fahrstil

# modelProfileFeatureRelaxedDrivingStyle
source: Relaxed Driving Style
de: Entspannter Fahrstil

# modelProfileFeatureAccessible
source: Accessible
de: Barrierefrei

# modelProfileFeatureRequires3G
source: Requires 3G Certification
de: Benötigt 3G-Zertifizierung

# pageCreateDriveTitle
source: Create Drive
de: Fahrt erstellen

# pageCreateDriveButtonCreate
source: Create
de: Erstellen

# pageDriveDetailTitle
source: Drive Detail
de: Fahrt Info

# pageDriveDetailLabelStartDrive
source: Start of drive
de: Start der Fahrt

# pageDriveDetailLabelEndDrive
source: End of drive
de: Ende der Fahrt

# pageDriveDetailLabelPickup
source: {seats, plural, =1{Pick up {user}}, other{Pick up {seats} people associated with {user}}
de: {seats, plural, one{{user} abholen} other{{seats} Personen abholen, die mit {user} fahren}}

# pageDriveDetailLabelDropoff
source: {seats, plural, =1{Drop off {user}}, other{Drop off {seats} people associated with {user}}
de: {seats, plural, one{{user} absetzen} other{{seats} Personen absetzen, die mit {user} fahren}}

# pageDriveDetailButtonCancel
source: Cancel Drive
de: Fahrt absagen

# pageDriveDetailCancelDialogTitle
source: Confirm Cancellation
de: Absage bestätigen

# pageDriveDetailCancelDialogMessage
source: Are you sure you want to cancel this drive?
de: Bist du sicher, dass du diese Fahrt absagen möchtest?

# pageDriveDetailCancelDialogToast
source: Drive cancelled.
de: Fahrt abgesagt.

# pageDrivesTitle
source: Drives
de: Fahrten

# pageDrivesTooltipOfferRide
source: Offer ride
de: Fahrt anbieten

# widgetTripBuilderTabUpcoming
source: Upcoming
de: Zukünftig

# widgetTripBuilderTabPast
source: Past
de: Vergangen

# pageSearchRideTitle
source: Search Ride
de: Mitfahrt suchen

# pageRidesTitle
source: Rides
de: Mitfahrten

# pageRidesTooltipSearchRide
source: Search ride
de: Fahrt suchen

# pageRideDetailTitle
source: Ride Detail
de: Mitfahrt Info

# pageRideDetailButtonRequest
source: Request Ride
de: Mitfahrt anfragen

# pageRideDetailButtonCancel
source: Cancel Ride
de: Mitfahrt absagen

# pageRideDetailButtonWithdraw
source: Withdraw request
de: Anfrage zurücknehmen

# pageRideDetailButtonRate
source: Rate Driver
de: Fahrt bewerten

# pageRideDetailCancelDialogTitle
source: Confirm Cancellation
de: Absage bestätigen

# pageRideDetailCancelDialogMessage
source: Are you sure you want to cancel this ride?
de: Bist du sicher, dass du diese Mitfahrt absagen möchtest?

# pageRideDetailCancelDialogToast
source: Ride cancelled.
de: Mitfahrt abgesagt.

# pageRideDetailRequestDialogTitle
source: Confirm Ride request
de: Mitfahrt anfragen

# pageRideDetailRequestDialogMessage
source: Are you sure you want to request this ride?
de: Bist du sicher, dass du diese Mitfahrt anfragen möchtest?

# pageRideDetailWithdrawDialogTitle
source: Confirm Withdrawal
de: Zurücknahme bestätigen

# pageRideDetailWithdrawDialogMessage
source: Are you sure you want to withdraw the request?
de: Bist du sicher, dass du diese Anfrage zurücknehmen möchtest?

# pageRideDetailWithdrawDialogToast
source: Request withdrawn.
de: Anfrage zurückgenommen.

# pageRideDetailLoginDialogTitle
source: Please login First
de: Bitte zuerst einloggen

# pageRideDetailLoginDialogMessage
source: You need to login to request a ride. If you don't have an account yet, please register first.
de: Du musst eingeloggt sein, um eine Mitfahrt anzufragen. Wenn du noch keinen Account hast, kannst du ihn hier erstellen.

# pageRideDetailBannerRequested
source: You have requested this ride.
de: Du hast diese Mitfahrt angefragt.

# pageRideDetailBannerRejected
source: This ride has been rejected.
de: Diese Mitfahrt wurde abgelehnt.
