Repository: motis-project/ridesharing-flutter
Catalog: lib/l10n/app_*.arb
Languages: de

# pageRideDetailBannerCancelledByDriver
source: This ride has been cancelled.
de: Diese Mitfahrt wurde abgesagt.

# pageRideDetailBannerCancelledByYou
source: You have cancelled this ride.
de: Du hast diese Mitfahrt abgesagt.

# pageDriveChatTitle
source: Drive Chat
de: Chats

# pageDriveChatEmptyMessage
source: No riders or pending rides
de: Du kannst mit deinen Mitfahrer*innen chatten, sobald du ihre Anfragen annimmst.

# pageDriveChatRiderHeadline
source: Riders
de: Mitfahrer*innen

# pageDriveChatRequestsHeadline
source: Ride requests
de: Mitfahrtanfragen

# cardPendingRideApproveDialogTitle
source: Confirm ride
de: Mitfahrt annehmen

# cardPendingRideApproveDialogMessage
source: Are you sure you want to confirm this ride?
de: Bist du sicher, dass du diese Mitfahrt annehmen möchtest?

# cardPendingRideApproveDialogSuccessSnackbar
source: Ride confirmed
de: Mitfahrt bestätigt

# cardPendingRideApproveDialogErrorSnackbar
source: Not enough seats available
de: Es sind nicht genügend Plätze verfügbar

# cardPendingRideRejectDialogTitle
source: Reject Ride
de: Mitfahrt ablehnen

# cardPendingRideRejectDialogMessage
source: Are you sure you want to reject this ride?
de: Bist du sicher, dass du diese Mitfahrt ablehnen möchtest?

# cardPendingRideRejectDialogSuccessSnackBar
source: Ride rejected
de: Mitfahrt abgelehnt

# appName
source: Motis Ride-Sharing App
de: Motis Mitfahr-App
